In [126]:

import mysql.connector as connector
import pandas as pd

conn = connector.connect(
    host = "localhost",
    user = "root",
    password = "Gaurav@123",
    database = "ecomm_db"
)

query = "SHOW TABLES"
tables = pd.read_sql(query,conn)
tables

/var/folders/r5/7y3th4yd7zj8nph2x77c53j40000gn/T/ipykernel_25114/143542196.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql(query,conn)

  Tables_in_ecomm_db
0          customers
1             orders

In [7]:
pip install pandas

Collecting pandas
  Using cached pandas-2.3.3-cp314-cp314-macosx_11_0_arm64.whl.metadata (91 kB)
Requirement already satisfied: numpy>=1.26.0 in /Users/gaurav/python/base_venv/lib/python3.14/site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/gaurav/python/base_venv/lib/python3.14/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: tzdata>=2022.7 in /Users/gaurav/python/base_venv/lib/python3.14/site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in /Users/gaurav/python/base_venv/lib/python3.14/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached pandas-2.3.3-cp314-cp314-macosx_11_0_arm64.whl (10.8 MB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Installing collected packages: pytz, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2/2 [pandas]━━━━ 1/2 [pandas]
Successfully installed pandas-2.3.3 pytz-2025.2
Note: you may need to restart the kernel to use updated packages.

In [8]:
# --------db connector------
from sqlalchemy import create_engine, text
from sqlalchemy.orm import sessionmaker
import mysql.connector as connector
import pandas as pd

engine = create_engine(
    "mysql+mysqlconnector://root:Gaurav%40123@localhost:3306/ecomm_db",
    echo = False
)

conn = connector.connect(
    host = "localhost",
    user = "root",
    password = "Gaurav@123",
    database = "ecomm_db"
)

cursor = conn.cursor(buffered= True)

In [68]:
query = "SHOW TABLES"
tables = pd.read_sql(query,engine)
tables

Empty DataFrame
Columns: [Tables_in_ecomm_db]
Index: []

In [69]:
customers = pd.read_csv("Customers.csv")
customers.head()

    customer_id  customer_zip_code_prefix        customer_city customer_state
0  I74lXDOfoqsp                      6020              goiania             GO
1  47TuLHF2s7X5                     23020               viamao             RS
2  dQ0dqI8Qwlj8                     75094             campinas             SP
3  iQCmWhNkIczb                     89284  santana de parnaiba             SP
4  Dp2g6JH8tO5Z                     39810             aripuana             MT

In [73]:
# creating table
# customers table
cursor = conn.cursor()

cursor.execute('''
    create table if not exists customers(
        customer_id varchar(50) primary key,
        customer_zip_code_prefix int,
        customer_city varchar(50),
        customer_state varchar(50)
        )
    ''')

In [72]:
cursor.execute("drop table customers")
conn.commit()

In [75]:
for _,row in customers.iterrows():
    cursor.execute(
        "insert into customers values (%s,%s,%s,%s)",
        (row['customer_id'],row['customer_zip_code_prefix'],row['customer_city'],row['customer_state'])
    )

conn.commit()

In [76]:
query = "select * from customers"

        customer_id  customer_zip_code_prefix   customer_city customer_state
0      0027MnmEcEx0                      8460          manaus             AM
1      006Qnh6UbZWp                     30662          santos             SP
2      00ciinAcviuC                      5847        brasilia             DF
3      00DP5EaE4Ro1                     44560       sao paulo             SP
4      00h7DNDgf3CN                     12286     morro agudo             SP
...             ...                       ...             ...            ...
38274  ZzUQ7JwfD76y                     13820     hortolandia             SP
38275  ZZW2wiXyKa6S                     21236  rio de janeiro             RJ
38276  ZZWtwAWkYXcW                      7813       sao paulo             SP
38277  zzXJDr2XBrBa                     40320       americana             SP
38278  zzZrs8hLEMxF                     36883    campo grande             MS

[38279 rows x 4 columns]

In [ ]:
orders = pd.read_csv('Orders.csv')

In [109]:
# orders table
cursor.execute('''
    create table if not exists orders(
        order_id varchar(50) primary key,
        customer_id varchar(50),
        order_purchase_timestamp DATETIME,
        order_approved_at DATETIME,
        FOREIGN KEY(customer_id) REFERENCES customers(customer_id)
        )
    ''')

In [113]:
for _,row in orders.iterrows():
    cursor.execute(
        "insert into orders values (%s,%s,%s,%s)",
        (row['order_id'],row['customer_id'],row['order_purchase_timestamp'],row['order_approved_at'])
    )

conn.commit()

In [106]:
# handling nan values in orders and removing duplicates

cursor.execute("DROP TABLE orders")
cursor.execute("SELECT COUNT(*) FROM orders")
cursor.fetchone()

ProgrammingError: 1051 (42S02): Unknown table 'ecomm_db.orders'

In [112]:
orders.isna().sum()
orders.dropna(inplace=True)

orders["order_id"].duplicated().sum()

np.int64(0)

In [116]:
df = pd.read_sql("SELECT * FROM orders", engine)
df

           order_id   customer_id order_purchase_timestamp   order_approved_at
0      000wgCAJVpMC  rWKDG6aXCjfe      2018-02-25 23:23:54 2018-02-26 00:00:28
1      005Zdc6VWVck  mTo2VbEI2xBD      2018-08-03 15:41:24 2018-08-03 15:55:30
2      008SMojznLhz  nLYDzcUcVt6i      2018-04-25 23:37:39 2018-04-25 23:51:53
3      00jc3H4oL9Y5  xxowrNxjfTGl      2018-05-17 09:18:52 2018-05-18 02:55:16
4      00KsrLWJzkJ6  S1ipsIBR1f7A      2018-04-27 14:06:22 2018-04-27 14:32:00
...             ...           ...                      ...                 ...
38267  ZZU7vg7AdbCm  E4Qwp4nN4Y0h      2017-10-19 10:36:34 2017-10-20 20:49:37
38268  zZuqz325xtpE  WDapXGDYY6yG      2018-07-31 17:07:16 2018-07-31 17:44:33
38269  zzvHedPW67B7  HF7RtmwwisKv      2018-06-22 07:42:57 2018-06-26 04:59:17
38270  Zzw3YCeBT144  BBjIMtrpKahB      2018-06-10 08:43:48 2018-06-12 04:17:45
38271  ZZwSQ1WLcez0  oD8SzmuIh8xh      2017-10-10 16:06:30 2017-10-10 16:30:51

[38272 rows x 4 columns]

In [124]:
# cursor.fetchall()
cursor.close()
conn.close()
# cursor = conn.cursor(buffered=True)

In [128]:
conn = connector.connect(
    host = "localhost",
    user = "root",
    password = "Gaurav@123",
    database = "ecomm_db"
)

cursor = conn.cursor(buffered = True)

In [16]:
cursor.execute("DROP TABLE products")
conn.commit()

In [2]:
products = pd.read_csv("Products.csv")

In [18]:
# products table
cursor.execute('''
    CREATE TABLE IF NOT EXISTS products (
        id INT AUTO_INCREMENT PRIMARY KEY,
        product_id VARCHAR(50),
        product_category_name VARCHAR(50),
        product_weight_g FLOAT,
        product_length_cm FLOAT,
        product_height_cm FLOAT,
        product_width_cm FLOAT
    )
    ''')

In [19]:
products.isna().sum()
products.dropna(inplace=True)
# products.duplicated()

In [20]:
products = products.where(pd.notna(products), None)

data = [
    (
        row.product_id,
        row.product_category_name,
        row.product_weight_g,
        row.product_length_cm,
        row.product_height_cm,
        row.product_width_cm
    )
    for _, row in products.iterrows()
]

cursor.executemany(
    """
    INSERT INTO products
    (product_id, product_category_name, product_weight_g,
     product_length_cm, product_height_cm, product_width_cm)
    VALUES (%s, %s, %s, %s, %s, %s)
    """,
    data
)

conn.commit()

In [3]:
pd.read_sql("select * from products", engine)

,id,product_id,product_category_name,product_weight_g,product_length_cm,product_height_cm,product_width_cm
0,1,1slxdgbgWFax,toys,50.0,16.0,5.0,11.0
1,2,77PgsiElQLeB,electronics,200.0,21.0,7.0,14.0
2,3,QVlD26X1y7NI,furniture_decor,1000.0,100.0,5.0,20.0
3,4,yWlFGkKYfrpa,toys,8950.0,40.0,30.0,40.0
4,5,h6MCbrwh5kiC,toys,2301.0,32.0,35.0,34.0
...,...,...,...,...,...,...,...
38096,38097,wr6barwyoaIE,toys,200.0,16.0,28.0,11.0
38097,38098,sPZVXBD9lf3e,toys,5150.0,22.0,3.0,22.0
38098,38099,Th6SHMsyTOMH,toys,430.0,21.0,11.0,17.0
38099,38100,PyjlDSHRGdSt,toys,1850.0,24.0,36.0,23.0
38100,38101,UZQyp4CdjAIi,toys,200.0,16.0,9.0,11.0

In [4]:
pd.read_sql("show tables", engine)

  Tables_in_ecomm_db
0          customers
1             orders
2           products

In [3]:
order_items = pd.read_csv("OrderItems.csv")
payments = pd.read_csv("Payments.csv")

In [6]:
#  order items table

order_items.isna().sum()
order_items.duplicated().sum()

np.int64(0)

In [8]:
cursor.execute('''
    CREATE TABLE if not exists order_items (
        id INT AUTO_INCREMENT PRIMARY KEY,
    
        order_id VARCHAR(50) NOT NULL,
        product_pk INT NOT NULL,
        seller_id VARCHAR(50) NOT NULL,
        price DECIMAL(10,2) NOT NULL,
        shipping_charges DECIMAL(10,2) NOT NULL,
    
        FOREIGN KEY (order_id) REFERENCES orders(order_id),
        FOREIGN KEY (product_pk) REFERENCES products(id)
    );
    ''')

In [11]:
pd.read_sql("desc order_items", engine)

              Field           Type Null  Key Default           Extra
0                id            int   NO  PRI    None  auto_increment
1          order_id    varchar(50)   NO  MUL    None
2        product_pk            int   NO  MUL    None
3         seller_id    varchar(50)   NO         None
4             price  decimal(10,2)   NO         None
5  shipping_charges  decimal(10,2)   NO         None

In [25]:
cursor.execute('''
    CREATE TABLE if not exists order_items_staging (
        order_id VARCHAR(50),
        product_id VARCHAR(50),
        seller_id VARCHAR(50),
        price DECIMAL(10,2),
        shipping_charges DECIMAL(10,2)
    );
''')

In [24]:
cursor.execute("drop table order_items_staging")
conn.commit()

ProgrammingError: 1051 (42S02): Unknown table 'ecomm_db.order_items_staging'

In [26]:
order_items = pd.read_csv("OrderItems.csv")
order_items.to_sql(
    "order_items_staging",
    engine,
    if_exists="append",
    index=False
)

38279

In [28]:
cursor.execute('''
        INSERT INTO order_items (order_id, product_pk, seller_id, price, shipping_charges)
    SELECT
        s.order_id,
        p.id,
        s.seller_id,
        s.price,
        s.shipping_charges
    FROM order_items_staging s
    JOIN products p
        ON s.product_id = p.product_id
    JOIN orders o
        ON s.order_id = o.order_id;
    ''')

In [29]:
conn.commit()

In [10]:
pd.read_sql("desc products", engine)

                   Field         Type Null  Key Default           Extra
0                     id          int   NO  PRI    None  auto_increment
1             product_id  varchar(50)  YES         None
2  product_category_name  varchar(50)  YES         None
3       product_weight_g        float  YES         None
4      product_length_cm        float  YES         None
5      product_height_cm        float  YES         None
6       product_width_cm        float  YES         None

In [14]:
cursor.execute('''
    CREATE TABLE IF NOT EXISTS payments (
        payment_id INT AUTO_INCREMENT PRIMARY KEY,
    
        order_id VARCHAR(50) NOT NULL,
        payment_sequential INT,
        payment_type VARCHAR(30),
        payment_installments INT,
        payment_value DECIMAL(10,2),
    
        FOREIGN KEY (order_id) REFERENCES orders(order_id)
    );
    ''')

In [16]:
for _, row in payments.iterrows():

    # ensure order exists
    cursor.execute(
        "SELECT 1 FROM orders WHERE order_id = %s",
        (row['order_id'],)
    )
    if cursor.fetchone() is None:
        continue

    cursor.execute(
        """
        INSERT INTO payments
        (order_id, payment_sequential, payment_type,
         payment_installments, payment_value)
        VALUES (%s, %s, %s, %s, %s)
        """,
        (
            row['order_id'],
            row['payment_sequential'],
            row['payment_type'],
            row['payment_installments'],
            row['payment_value']
        )
    )

conn.commit()

In [30]:
pd.read_sql("show tables", engine)

    Tables_in_ecomm_db
0            customers
1          order_items
2  order_items_staging
3               orders
4             payments
5             products

In [33]:
pd.read_sql("desc order_items", engine)

              Field           Type Null  Key Default           Extra
0                id            int   NO  PRI    None  auto_increment
1          order_id    varchar(50)   NO  MUL    None
2        product_pk            int   NO  MUL    None
3         seller_id    varchar(50)   NO         None
4             price  decimal(10,2)   NO         None
5  shipping_charges  decimal(10,2)   NO         None

In [34]:
pd.read_sql("select * from order_items", engine)

,id,order_id,product_pk,seller_id,price,shipping_charges
0,1,u6rPMRAYIGig,1,3jwvL6ihC45G,24.10,20.90
1,2,ohY8f4FEbX19,2,GlLj704QXlDB,42.89,12.28
2,3,I28liQek73i2,3,V3iKL8r9W9NR,50.21,67.11
3,4,bBG1T89mlY8W,4,RNBdBKsXebna,89.10,62.05
4,5,CYxJJSQS8Lbo,5,5Ja2lH0N2OZt,2139.99,9.41
...,...,...,...,...,...,...
482710,482712,mCPofb7A1aTq,22260,Gp2lLacVPwug,104.45,30.24
482711,482713,mCPofb7A1aTq,21101,Gp2lLacVPwug,104.45,30.24
482712,482714,mCPofb7A1aTq,10658,Gp2lLacVPwug,104.45,30.24
482713,482715,mCPofb7A1aTq,10571,Gp2lLacVPwug,104.45,30.24
482714,482716,mCPofb7A1aTq,7941,Gp2lLacVPwug,104.45,30.24

In [35]:
pd.read_sql("desc payments", engine)

                  Field           Type Null  Key Default           Extra
0            payment_id            int   NO  PRI    None  auto_increment
1              order_id    varchar(50)   NO  MUL    None
2    payment_sequential            int  YES         None
3          payment_type    varchar(30)  YES         None
4  payment_installments            int  YES         None
5         payment_value  decimal(10,2)  YES         None

In [36]:
pd.read_sql("select * from payments", engine)

,payment_id,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,1,u6rPMRAYIGig,1,credit_card,2,155.77
1,2,ohY8f4FEbX19,1,credit_card,1,4.07
2,3,I28liQek73i2,1,wallet,1,381.59
3,4,bBG1T89mlY8W,1,credit_card,3,14.76
4,5,CYxJJSQS8Lbo,1,wallet,1,284.09
...,...,...,...,...,...,...
76539,76540,QKBW3XKevmfn,1,credit_card,1,209.51
76540,76541,Tjiw9bj8HtLr,1,credit_card,2,323.31
76541,76542,mCPofb7A1aTq,1,wallet,1,170.71
76542,76543,scVuqN10zbgb,1,credit_card,10,100.65
76543,76544,oLKXX8tqU6eQ,1,credit_card,4,984.20

In [10]:
with engine.begin() as conn:
    conn.execute(
        text("ALTER TABLE orders DROP COLUMN order_approved_at;")
    )

In [13]:
with engine.begin() as conn:
    conn.execute(
        text("ALTER TABLE orders MODIFY COLUMN order_purchase_timestamp DATETIME DEFAULT CURRENT_TIMESTAMP;")
        )

In [15]:
pd.read_sql('desc orders', engine)

,Field,Type,Null,Key,Default,Extra
0,order_id,varchar(50),NO,PRI,None,
1,customer_id,varchar(50),YES,MUL,None,
2,order_purchase_timestamp,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED

In [18]:
pd.read_sql('desc customers', engine)

            Field         Type Null  Key Default Extra
0     customer_id  varchar(50)   NO  PRI    None
1   customer_city  varchar(50)  YES         None
2  customer_state  varchar(50)  YES         None

In [17]:
with engine.begin() as conn:
    conn.execute(
        text("ALTER TABLE customers DROP COLUMN customer_zip_code_prefix;")
    )